cloudn1ne/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/**
  ******************************************************************************
  * @file    cpp_main.c
  * @author  Georg Swoboda <cn@warp.at>
  * @brief   ROS Node main C++ routines
  ******************************************************************************
  * 
  ******************************************************************************
  */


#include "board.h"

#include <cpp_main.h>
#include "main.h"
#include "panel.h"
#include "emergency.h"
#include "spiflash.h"
#include "stm32f1xx_hal.h"
#include "ringbuffer.h"
#include "ros.h"
#include "ros/time.h"
#include "tf/tf.h"
#include "tf/transform_broadcaster.h"
#include "std_msgs/Bool.h"
#include "std_msgs/String.h"
#include "std_msgs/Float32.h"
#include "std_msgs/Int16.h"
#include "std_msgs/UInt8.h"
#include "std_msgs/UInt16.h"
#include "std_msgs/UInt32.h"
#include "std_msgs/Int16MultiArray.h"
#include "nav_msgs/Odometry.h"
#include "nbt.h"
#include "geometry_msgs/Twist.h"
#include "std_srvs/SetBool.h"
#include "std_srvs/Empty.h"

// IMU
#include "imu/imu.h"
#include "sensor_msgs/Imu.h"
#include "sensor_msgs/MagneticField.h"
#include "sensor_msgs/Temperature.h"
#include "mowgli/magnetometer.h"

// Flash Configuration Services
#include "mowgli/SetCfg.h"
#include "mowgli/GetCfg.h"

// Status message
#include "mowgli/status.h"


#define MAX_MPS	  	0.6		 	// Allow maximum speed of 0.6 m/s 
#define PWM_PER_MPS 300.0		// PWM value of 300 means 1 m/s bot speed

#define WHEEL_BASE  0.325		// The distance between the center of the wheels in meters
#define WHEEL_DIAMETER 0.198 	// The diameter of the wheels in meters

#define ODOM_NBT_TIME_MS   20 	// 20ms
#define IMU_NBT_TIME_MS    20  
#define MOTORS_NBT_TIME_MS 50
#define STATUS_NBT_TIME_MS 100

extern uint8_t RxBuffer[RxBufferSize];
struct ringbuffer rb;

ros::Time last_cmd_vel(0, 0);
ros::Time last_cmd_blade(0, 0);
uint32_t last_cmd_vel_age;		// age of last velocity command
uint32_t last_cmd_blade_age;		// age of last blade command

// drive motor control
static uint8_t left_speed=0;
static uint8_t right_speed=0;
static uint8_t left_dir=0;
static uint8_t right_dir=0;

// blade motor control
static uint8_t blade_on_off=0;

static uint8_t svcCfgDataBuffer[256];

ros::NodeHandle nh;

// odom message
geometry_msgs::Quaternion quat;
geometry_msgs::TransformStamped t;
tf::TransformBroadcaster broadcaster;
char base_link[] = "base_link";
char odom[] = "odom";

//double radius = 0.04;                              //Wheel radius, in m
//double wheelbase = 0.187;                          //Wheelbase, in m
double two_pi = 6.28319;
double speed_act_left = 0.0;
double speed_act_right = 0.0;
double speed_req1 = 0.0;
double speed_req2 = 0.0;
double speed_dt = 0.0;
double x_pos = 0.0;
double y_pos = 0.0;
double theta = 0.0;
ros::Time current_time;
// ros::Time speed_time;
// ---
// double rate = 10.0;
double linear_scale_positive = 1.0;
double linear_scale_negative = 1.0;
double angular_scale_positive = 1.0;
double angular_scale_negative = 1.0;
bool publish_tf = false; // publish odom -> base_link transform
double dt = 0.0;
double dx = 0.0;
double dy = 0.0;
double dth = 0.0;
double dxy = 0.0;
double vx = 0.0;
double vy = 0.0;

float imu_onboard_temperature;

// std_msgs::String str_msg;
//std_msgs::Float32 f32_battery_voltage_msg;
//std_msgs::Float32 f32_charge_voltage_msg;
//std_msgs::Float32 f32_charge_current_msg;
//std_msgs::Int16 int16_charge_pwm_msg;
//std_msgs::Bool bool_blade_state_msg;
//std_msgs::Bool bool_charging_state_msg;
std_msgs::Int16MultiArray buttonstate_msg;
nav_msgs::Odometry odom_msg;
//std_msgs::UInt32 left_encoder_ticks_msg;
//std_msgs::UInt32 right_encoder_ticks_msg;

// IMU
// external IMU (i2c)
sensor_msgs::Imu imu_msg;
sensor_msgs::MagneticField imu_mag_msg;
// onboard IMU (accelerometer and temp)
sensor_msgs::Imu imu_onboard_msg;
//sensor_msgs::Temperature imu_onboard_temp_msg;

//sensor_msgs::MagneticField imu_mag_calibration_msg;
mowgli::magnetometer imu_mag_calibration_msg;

// mowgli status message
mowgli::status status_msg;

/*
 * PUBLISHERS
 */
// ros::Publisher chatter("version", &str_msg);
// ros::Publisher pubBatteryVoltage("battery_voltage", &f32_battery_voltage_msg);
// ros::Publisher pubChargeVoltage("charge_voltage", &f32_charge_voltage_msg);
// ros::Publisher pubChargeCurrent("charge_current", &f32_charge_current_msg);
// ros::Publisher pubChargePWM("charge_pwm", &int16_charge_pwm_msg);
// ros::Publisher pubChargeingState("charging_state", &bool_charging_state_msg);
// ros::Publisher pubBladeState("blade_state", &bool_blade_state_msg);
ros::Publisher pubOdom("odom", &odom_msg);
// ros::Publisher pubLeftEncoderTicks("left_encoder_ticks", &left_encoder_ticks_msg);
// ros::Publisher pubRightEncoderTicks("right_encoder_ticks", &right_encoder_ticks_msg);
ros::Publisher pubButtonState("buttonstate", &buttonstate_msg);
ros::Publisher pubStatus("mowgli/status", &status_msg);

// IMU onboard
ros::Publisher pubIMUOnboard("imu_onboard/data_raw", &imu_onboard_msg);
// ros::Publisher pubIMUOnboardTemp("imu_onboard/temp", &imu_onboard_temp_msg);

// IMU external
ros::Publisher pubIMU("imu/data_raw", &imu_msg);
ros::Publisher pubIMUMag("imu/mag", &imu_mag_msg);
ros::Publisher pubIMUMagCalibration("imu/mag_calibration", &imu_mag_calibration_msg);


/*
 * SUBSCRIBERS
 */
extern "C" void CommandVelocityMessageCb(const geometry_msgs::Twist& msg);
ros::Subscriber<geometry_msgs::Twist> subCommandVelocity("cmd_vel", CommandVelocityMessageCb);

// TODO ros::Subscriber<std_msgs::Bool> subLEDSet("cmd_panel_led_set", CommandLEDSetMessageCb);
// TODO ros::Subscriber<std_msgs::Bool> subLEDFlashSlow("cmd_panel_led_flash_slow", CommandLEDFlashSlowMessageCb);
// TODO ros::Subscriber<std_msgs::Bool> subLEDFlashFast("cmd_panel_led_flash_fast", CommandLEDFlashFastMessageCb);
// TODO ros::Subscriber<std_msgs::Bool> subLEDClear("cmd_panel_led_clear", CommandLEDClearMessageCb);

// SERVICES
void cbSetCfg(const mowgli::SetCfgRequest &req, mowgli::SetCfgResponse &res);
void cbGetCfg(const mowgli::GetCfgRequest &req, mowgli::GetCfgResponse &res);
void cbEnableMowerMotor(const std_srvs::SetBool::Request &req, std_srvs::SetBool::Response &res);
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res);

ros::ServiceServer<mowgli::SetCfgRequest, mowgli::SetCfgResponse> svcSetCfg("mowgli/SetCfg", cbSetCfg);
ros::ServiceServer<mowgli::GetCfgRequest, mowgli::GetCfgResponse> svcGetCfg("mowgli/GetCfg", cbGetCfg);
ros::ServiceServer<std_srvs::SetBool::Request, std_srvs::SetBool::Response> svcEnableMowerMotor("mowgli/EnableMowerMotor", cbEnableMowerMotor);
ros::ServiceServer<std_srvs::Empty::Request, std_srvs::Empty::Response> svcReboot("mowgli/Reboot", cbReboot);


/*
 * NON BLOCKING TIMERS
 */
static nbt_t ros_nbt;
static nbt_t publish_nbt;
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t odom_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;

/*
 * reboot flag, if true we reboot after next publish_nbt
 */
static bool reboot_flag = false;

/*
 * receive and parse cmd_vel messages
 * actual driving (updating drivemotors) is done in the drivemotors_nbt
 */
extern "C" void CommandVelocityMessageCb(const geometry_msgs::Twist& msg)
{
		last_cmd_vel = nh.now();

		//	debug_printf("x: %f  z: %f\r\n", msg.linear.x, msg.angular.z);

		// calculate twist speeds to add/substract 
		float left_twist_mps = -1.0 * msg.angular.z * WHEEL_BASE * 0.5;
		float right_twist_mps =  msg.angular.z * WHEEL_BASE * 0.5;
    

		// add them to the linear speed 
		float left_mps = msg.linear.x + left_twist_mps;
        float right_mps = msg.linear.x + right_twist_mps;

		// cap left motor speed to MAX_MPS
		if (left_mps > MAX_MPS)
		{
			left_mps = MAX_MPS;
		}
		else if (left_mps < -1*MAX_MPS)
		{
			left_mps = -1*MAX_MPS;
		}
		// cap right motor speed to MAX_MPS
		if (right_mps > MAX_MPS)
		{
			right_mps = MAX_MPS;
		}
		else if (right_mps < -1*MAX_MPS)
		{
			right_mps = -1*MAX_MPS;
		}

		// set directions		
		left_dir = (left_mps >= 0)?1:0;
		right_dir = (right_mps >= 0)?1:0;

		// set drivemotors PWM values
		left_speed = abs(left_mps * PWM_PER_MPS);
		right_speed = abs(right_mps * PWM_PER_MPS);		

	//	debug_printf("left_mps: %f (%c)  right_mps: %f (%c)\r\n", left_mps, left_dir?'F':'R', right_mps, right_dir?'F':'R');
}

extern "C" void cdc_receive_put(uint8_t value)
{
	ringbuffer_putchar(&rb, value);
}


/*
 * Update various chatters topics
 */
extern "C" void chatter_handler()
{
	  if (NBT_handler(&publish_nbt))
	  {
		  /*
		  char version[] = "version: 0.1";
		  str_msg.data = version;
		  chatter.publish(&str_msg);
		  */
		  /*
		  f32_battery_voltage_msg.data = battery_voltage;
		  pubBatteryVoltage.publish(&f32_battery_voltage_msg);

		  f32_charge_voltage_msg.data = charge_voltage;
		  pubChargeVoltage.publish(&f32_charge_voltage_msg);

		  f32_charge_current_msg.data = charge_current;
		  pubChargeCurrent.publish(&f32_charge_current_msg);

		  int16_charge_pwm_msg.data = chargecontrol_pwm_val;
		  pubChargePWM.publish(&int16_charge_pwm_msg);

		  bool_charging_state_msg.data =  chargecontrol_is_charging;
		  pubChargeingState.publish(&bool_charging_state_msg);
*/
 		  //bool_blade_state_msg.data = true; // TODO: read blade status
//		  pubBladeState.publish(&bool_blade_state_msg);

#ifdef IMU_ONBOARD_TEMP
		  imu_onboard_temperature = IMU_Onboard_ReadTemp();
#else
		  imu_onboard_temperature = -100;
#endif
/*
		  imu_onboard_temp_msg.variance = 0.5;		// 0.5°C resolution
		  imu_onboard_temp_msg.header.frame_id = base_link;
		  pubIMUOnboardTemp.publish(&imu_onboard_temp_msg);
*/
		  HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);         // flash LED

		  // reboot if set via cbReboot (mowgli/Reboot)
		  if (reboot_flag)
		  {
			nh.spinOnce();
			NVIC_SystemReset();
			// we never get here ...
		  }
	  }
}

/*
 *  Drive Motors handler
 *  Blade Motor handler
 */
extern "C" void motors_handler()
{
	  if (NBT_handler(&motors_nbt))
	  {
		if (Emergency_State())
		{
			setDriveMotors(0,0,0,0);
			setBladeMotor(0);
		}
		else {
			// if the last velocity cmd is older than 1sec we stop the drive motors
			last_cmd_vel_age = nh.now().sec - last_cmd_vel.sec;			
			if (last_cmd_vel_age > 1) {
				setDriveMotors(0, 0, left_dir, right_dir);
			}
			else {
				setDriveMotors(left_speed, right_speed, left_dir, right_dir);
			}

			// if the last blade cmd is older than 25sec we stop the motor
			last_cmd_blade_age = nh.now().sec - last_cmd_blade.sec;
			if (last_cmd_blade_age > 25) {
				setBladeMotor(0);
			}
			else {
				setBladeMotor(blade_on_off);
			}
		}
	  }
}

/*
 *  Keyboard/LED Panel handler
 */
extern "C" void panel_handler()
{
	  if (NBT_handler(&panel_nbt))
	  {			  
		PANEL_Tick();
		if (buttonupdated == 1)
		{
			debug_printf("buttonstate changed\r\n");
			buttonstate_msg.data = (int16_t*) malloc(sizeof(int16_t) * PANEL_BUTTON_BYTES);
			buttonstate_msg.data_length = PANEL_BUTTON_BYTES;
			memcpy(buttonstate_msg.data,buttonstate,sizeof(int16_t) * PANEL_BUTTON_BYTES);
			pubButtonState.publish(&buttonstate_msg);		
			free(buttonstate_msg.data);
			buttonupdated=0;
		}
	  }
}

extern "C" void broadcast_handler()
{
	  if (NBT_handler(&imu_nbt))
	  {
		////////////////////////////////////////
		// IMU Messages
		////////////////////////////////////////		
		imu_msg.header.frame_id = "imu";
		
		// No Orientation in IMU message
		imu_msg.orientation.x = 0;
		imu_msg.orientation.y = 0;
		imu_msg.orientation.z = 0;
		imu_msg.orientation.w = 0;
		imu_msg.orientation_covariance[0] = -1;

		/**********************************/
		/* Exernal Accelerometer 		  */
		/**********************************/
#ifdef IMU_ACCELERATION
		// Linear acceleration		
		IMU_ReadAccelerometer(&imu_msg.linear_acceleration.x, &imu_msg.linear_acceleration.y, &imu_msg.linear_acceleration.z);		
		IMU_AccelerometerSetCovariance(imu_msg.linear_acceleration_covariance);	
#else
		imu_msg.linear_acceleration.x = imu_msg.linear_acceleration.y = imu_msg.linear_acceleration.z = 0;		
		imu_msg.linear_acceleration_covariance[0] = -1;
#endif

		/**********************************/
		/* Exernal Gyro					  */
		/**********************************/
#ifdef IMU_ANGULAR
		// Angular velocity
		IMU_ReadGyro(&imu_msg.angular_velocity.x, &imu_msg.angular_velocity.y, &imu_msg.angular_velocity.z);
		IMU_GyroSetCovariance(imu_msg.angular_velocity_covariance);	
#else
		imu_msg.angular_velocity.x = imu_msg.angular_velocity.y = imu_msg.angular_velocity.z = 0;		
		imu_msg.angular_velocity_covariance[0] = -1;
#endif		
		imu_msg.header.stamp = nh.now();
		pubIMU.publish(&imu_msg);

		/**********************************/
		/* Exernal Magnetometer Corrected */
		/**********************************/
		double x,y,z;	

		// Orientation (Magnetometer)
		imu_mag_msg.header.frame_id = "imu";								
	 	IMU_ReadMagnetometer(&x, &y, &z);
		imu_mag_msg.magnetic_field.x = x;
		imu_mag_msg.magnetic_field.y = y;
		imu_mag_msg.magnetic_field.z = z;

		// covariance is fixed for now
		imu_mag_msg.magnetic_field_covariance[0] = 1e-3;
		imu_mag_msg.magnetic_field_covariance[4] = 1e-3;
		imu_mag_msg.magnetic_field_covariance[8] = 1e-3;
		imu_mag_msg.header.stamp = nh.now();
		pubIMUMag.publish(&imu_mag_msg);

		/******************************************/
		/* Exernal Magnetometer RAW (Calibration) */
		/******************************************/
		IMU_ReadMagnetometerRaw(&x, &y, &z);
		imu_mag_calibration_msg.x = x;
		imu_mag_calibration_msg.y = y;
		imu_mag_calibration_msg.z = z;

		imu_mag_msg.header.stamp = nh.now();
		pubIMUMagCalibration.publish(&imu_mag_calibration_msg);

		/**********************************/
		/* Onboard (GForce) Accelerometer */
		/**********************************/
#ifdef IMU_ONBOARD_ACCELERATION
		IMU_Onboard_ReadAccelerometer(&imu_onboard_msg.linear_acceleration.x, &imu_onboard_msg.linear_acceleration.y, &imu_onboard_msg.linear_acceleration.z);		
		IMU_Onboard_AccelerometerSetCovariance(imu_onboard_msg.linear_acceleration_covariance);	
#else
		imu_onboard_msg.linear_acceleration.x = imu_onboard_msg.linear_acceleration.y = imu_onboard_msg.linear_acceleration.z = 0;		
#endif
		// no onboard gyro so angular velocities are always zero
		imu_onboard_msg.angular_velocity.x = imu_onboard_msg.angular_velocity.y = imu_onboard_msg.angular_velocity.z = 0;		
		imu_onboard_msg.angular_velocity_covariance[0] = -1;		// indicate *not valid* to EKF
		imu_onboard_msg.header.stamp = nh.now();
		pubIMUOnboard.publish(&imu_onboard_msg);		
	  } // if (NBT_handler(&imu_nbt))

  	  if (NBT_handler(&status_nbt))
	  {
		////////////////////////////////////////
		// mowgli/status Message
		////////////////////////////////////////		
		status_msg.stamp = nh.now();
		status_msg.rain_detected = RAIN_Sense();
		status_msg.emergency_tilt_mech_triggered = Emergency_Tilt();
		status_msg.emergency_tilt_accel_triggered = Emergency_LowZAccelerometer();
		status_msg.emergency_left_wheel_lifted = Emergency_WheelLiftBlue();
		status_msg.emergency_right_wheel_lifted = Emergency_WheelLiftRed();
		status_msg.emergency_stopbutton_triggered = Emergency_StopButtonYellow() || Emergency_StopButtonWhite();
		status_msg.left_encoder_ticks = left_encoder_ticks;
		status_msg.right_encoder_ticks = right_encoder_ticks;
		status_msg.v_charge = charge_voltage;
		status_msg.i_charge = charge_current;
		status_msg.v_battery = battery_voltage;
		status_msg.charge_pwm = chargecontrol_pwm_val;
		status_msg.is_charging = chargecontrol_is_charging;
		status_msg.imu_temp = imu_onboard_temperature;
		status_msg.blade_motor_ctrl_enabled = true;	// hardcoded for now
		status_msg.drive_motor_ctrl_enabled = true; // hardcoded for now
		pubStatus.publish(&status_msg);		
	  } // if (NBT_handler(&status_nbt))

	  if (NBT_handler(&odom_nbt))
	  {					
		speed_act_left = left_wheel_speed_val/PWM_PER_MPS;			// wheel speed in m/s
		speed_act_right = right_wheel_speed_val/PWM_PER_MPS;		// wheel speed in m/s
		// debug_printf("speed_act_left: %f speed_act_right: %f\r\n",  speed_act_left, speed_act_right);		
		dt = (ODOM_NBT_TIME_MS/1000.0);
		dxy = (speed_act_left+speed_act_right)*dt/2.0;
		dth = - 1.0 * ((speed_act_right-speed_act_left)*dt)/WHEEL_BASE;

		//debug_printf("dt: %f dxy: %f dth: %f\r\n",  dt, dxy, dth);		

		if (dth > 0) dth *= angular_scale_positive;
    	if (dth < 0) dth *= angular_scale_negative;
    	if (dxy > 0) dxy *= linear_scale_positive;
    	if (dxy < 0) dxy *= linear_scale_negative;

    	dx = cos(dth) * dxy;
    	dy = sin(dth) * dxy;

    	x_pos += (cos(theta) * dx - sin(theta) * dy);
    	y_pos += (sin(theta) * dx + cos(theta) * dy);
    	theta += dth;

    	if(theta >= two_pi) theta -= two_pi;
    	if(theta <= -two_pi) theta += two_pi;

		quat = tf::createQuaternionFromYaw(theta);
		
		//////////////////////////////////////////////////
		// odom message
		//////////////////////////////////////////////////
		odom_msg.header.stamp = nh.now(); 	
		odom_msg.header.frame_id = odom;
		odom_msg.pose.pose.position.x = x_pos;
		odom_msg.pose.pose.position.y = y_pos;
		odom_msg.pose.pose.position.z = 0.0;
		odom_msg.pose.pose.orientation = quat;
		if (speed_act_left == 0 && speed_act_right == 0){
			odom_msg.pose.covariance[0] = 1e-9;
			odom_msg.pose.covariance[7] = 1e-3;
			odom_msg.pose.covariance[8] = 1e-9;
			odom_msg.pose.covariance[14] = 1e6;
			odom_msg.pose.covariance[21] = 1e6;
			odom_msg.pose.covariance[28] = 1e6;
			odom_msg.pose.covariance[35] = 1e-9;
			odom_msg.twist.covariance[0] = 1e-9;
			odom_msg.twist.covariance[7] = 1e-3;
			odom_msg.twist.covariance[8] = 1e-9;
			odom_msg.twist.covariance[14] = 1e6;
			odom_msg.twist.covariance[21] = 1e6;
			odom_msg.twist.covariance[28] = 1e6;
			odom_msg.twist.covariance[35] = 1e-9;
		}
		else{
			odom_msg.pose.covariance[0] = 1e-3;
			odom_msg.pose.covariance[7] = 1e-3;
			odom_msg.pose.covariance[8] = 0.0;
			odom_msg.pose.covariance[14] = 1e6;
			odom_msg.pose.covariance[21] = 1e6;
			odom_msg.pose.covariance[28] = 1e6;
			odom_msg.pose.covariance[35] = 1e3;
			odom_msg.twist.covariance[0] = 1e-3;
			odom_msg.twist.covariance[7] = 1e-3;
			odom_msg.twist.covariance[8] = 0.0;
			odom_msg.twist.covariance[14] = 1e6;
			odom_msg.twist.covariance[21] = 1e6;
			odom_msg.twist.covariance[28] = 1e6;
			odom_msg.twist.covariance[35] = 1e3;
		}

		vx = (dt == 0)?  0 : (speed_act_left+speed_act_right)/2.0;
	//	vth = (dt == 0)? 0 : (speed_act_right-speed_act_left)/WHEEL_BASE;
		odom_msg.child_frame_id = base_link;
		odom_msg.twist.twist.linear.x = vx;
		odom_msg.twist.twist.linear.y = 0.0;
		odom_msg.twist.twist.angular.z = dth;
		pubOdom.publish(&odom_msg);

		// pub encoder values as well
		/*
		left_encoder_ticks_msg.data = left_encoder_ticks;
		pubLeftEncoderTicks.publish(&left_encoder_ticks_msg);
		right_encoder_ticks_msg.data = right_encoder_ticks;
		pubRightEncoderTicks.publish(&right_encoder_ticks_msg);
		*/
	  } // if (NBT_handler(&broadcast_nbt))
}

/*
 *  callback for mowgli/GetCfg Service
 */
void cbGetCfg(const mowgli::GetCfgRequest &req, mowgli::GetCfgResponse &res) 
{	
    debug_printf("cbGetCfg:\r\n");	
	debug_printf(" name: %s\r\n", req.name);

	res.data_length = SPIFLASH_ReadCfgValue(req.name, &res.type, svcCfgDataBuffer);

	if (res.data_length > 0)
	{		
		res.data = (uint8_t*)&svcCfgDataBuffer;	
		res.status = 1;
	}
	else
	{
		res.status = 0;
	}
}

/*
 *  callback for mowgli/SetCfg Service
 */
void cbSetCfg(const mowgli::SetCfgRequest &req, mowgli::SetCfgResponse &res) {
	union {
		float f;
		uint8_t b[4];
	} float_val;

	union {
		double d;
		uint8_t b[8];
	} double_val;
	uint8_t i;

    debug_printf("cbSetCfg:\r\n");
	debug_printf(" type: %d\r\n", req.type);
	debug_printf(" len: %d\r\n", req.data_length);
	debug_printf(" name: %s\r\n", req.name);

	if (req.type == 0) // TYPE_INT32 (0)
	{
		int32_t int32_val = (req.data[0]) + (req.data[1]<<8) + (req.data[2]<<16) + (req.data[3]<<24);
		debug_printf("(int32) data: %d\r\n", int32_val);			
	}
	if (req.type == 1) // TYPE_UINT32 (1)
	{
		uint32_t uint32_val = (req.data[0]) + (req.data[1]<<8) + (req.data[2]<<16) + (req.data[3]<<24);
		debug_printf("(uint32) data: %d\r\n", uint32_val);			
	}
	if (req.type == 2) // TYPE_FLOAT (2)
	{		
		for (i=0;i<4;i++)
		{
			float_val.b[i] = req.data[i];
		}		
		debug_printf("(float) data: %f\r\n", float_val.f);					
	}
	if (req.type == 3)  // TYPE_DOUBLE (3)
	{		
		for (i=0;i<8;i++)
		{
			double_val.b[i] = req.data[i];
		}
		debug_printf("(double) data: %Lf\r\n", double_val.d);			
	}
	if (req.type == 4)	// TYPE_STRING (4)
	{	
		debug_printf("(string) data: '");				
		for (i=0;i<req.data_length;i++)
		{
			debug_printf("%c", req.data[i]);
		}
		debug_printf("'\r\n");	
	}
	if (req.type == 5)	// TYPE_BARRAY (5)
	{	
		debug_printf("(byte array) data: '");				
		for (i=0;i<req.data_length;i++)
		{
			debug_printf("0x%02x ", req.data[i]);
		}
		debug_printf("'\r\n");	
	}

	// debug print data[] array
	for (i=0;i<req.data_length;i++)
	{
		debug_printf(" data[%d]: %d\r\n", i, req.data[i]);	
	}		

	SPIFLASH_WriteCfgValue(req.name, req.type, req.data_length, req.data);
	res.status = 1;
}

/*
 *  callback for mowgli/EnableMowerMotor Service
 */
void cbEnableMowerMotor(const std_srvs::SetBool::Request &req, std_srvs::SetBool::Response &res)
{
	//debug_printf("cbEnableMowerMotor:\r\n");
	last_cmd_blade = nh.now();	// if the last blade cmd is older than 25sec the motor will be stopped !
	blade_on_off = req.data;
    if (req.data) {        		
        res.success = true;
        res.message = "Mower Blade Motor has been started";
    }
    else {
        res.success = false;
        res.message = "Mower Blade Motor is being stopped";
    }    
}

/*
 *  callback for mowgli/Reboot Service
 */
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res)
{
	//debug_printf("cbReboot:\r\n");
	reboot_flag = true;	
}

/*
 * ROS housekeeping
 */
extern "C" void spinOnce()
{
	  if (NBT_handler(&ros_nbt))
	  {
			nh.spinOnce();
	  }
}

/* 
 *  Initialize rosserial
 */
extern "C" void init_ROS()
{
	ringbuffer_init(&rb, RxBuffer, RxBufferSize);

	// Initialize ROS
	nh.initNode();

	// Initialize TF Broadcaster
	broadcaster.init(nh);

	// Initialize Pubs
	//nh.advertise(pubBatteryVoltage);
	//nh.advertise(pubChargeVoltage);
	//nh.advertise(pubChargeCurrent);
	//nh.advertise(pubChargePWM);
	nh.advertise(pubOdom);

	//nh.advertise(pubBladeState);
	//nh.advertise(pubChargeingState);
	//nh.advertise(pubLeftEncoderTicks);
	//nh.advertise(pubRightEncoderTicks);
	nh.advertise(pubButtonState);
	nh.advertise(pubIMU);
	nh.advertise(pubIMUMag);
	nh.advertise(pubIMUMagCalibration);
	nh.advertise(pubIMUOnboard);
	//nh.advertise(pubIMUOnboardTemp);
	nh.advertise(pubStatus);
	
	// Initialize Subscribers
	nh.subscribe(subCommandVelocity);

	// Initialize Services	
	nh.advertiseService(svcSetCfg);	  
	nh.advertiseService(svcGetCfg);	  
    nh.advertiseService(svcEnableMowerMotor);
	nh.advertiseService(svcReboot);
	
	// Initialize Timers
	NBT_init(&publish_nbt, 1000);
	NBT_init(&panel_nbt, 100);	
	NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
	NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
	NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
	NBT_init(&odom_nbt, ODOM_NBT_TIME_MS);
	NBT_init(&ros_nbt, 10);	
}